["Two wrongs don't make a right.","The pen is mightier than the sword.","When in Rome, do as the Romans.","The squeaky wheel gets the grease.","When the going gets tough, the tough get going.","No man is an island.","Fortune favors the bold.","People who live in glass houses should not throw stones.","Hope for the best, but prepare for the worst.","Better late than never.","Birds of a feather flock together.","Keep your friends close and your enemies closer.","A picture is worth a thousand words.","There's no such thing as a free lunch.","There's no place like home.","Discretion is the greater part of valor.","The early bird catches the worm.","Never look a gift horse in the mouth.","You can't make an omelet without breaking a few eggs.","God helps those who help themselves.","You can't always get what you want.","Cleanliness is next to godliness.","A watched pot never boils.","Beggars can't be choosers.","Actions speak louder than words.","If it ain't broke, don't fix it.","Practice makes perfect.","Too many cooks spoil the broth.","Easy come, easy go.","Don't bite the hand that feeds you.","All good things must come to an end.","If you can't beat 'em, join 'em.","One man's trash is another man's treasure.","There's no time like the present.","Beauty is in the eye of the beholder.","Necessity is the mother of invention.","A penny saved is a penny earned.","Familiarity breeds contempt.","You can't judge a book by its cover.","Good things come to those who wait.","Don't put all your eggs in one basket.","Two heads are better than one.","The grass is always greener on the other side of the hill.","Do unto others as you would have them do unto you.","A chain is only as strong as its weakest link.","Honesty is the best policy.","Absence makes the heart grow fonder.","You can lead a horse to water, but you can't make him drink.","Don't count your chickens before they hatch.","If you want something done right, you have to do it yourself.","Absence makes the heart grow fonder","A journey of a thousand miles begins with a single step","All good things must come to an end","A picture is worth a thousand words","A watched pot never boils","Beggars can’t be choosers","Beauty is in the eye of the beholder","Better late than never","Birds of a feather flock together","Cleanliness is next to godliness","Don’t bite the hand that feeds you","Don’t count your chickens before they hatch.","Don’t judge a book by its cover","Don’t put all of your eggs in one basket","Don’t put off until tomorrow what you can do today","Don’t put too many irons in the fire","Easy come, easy go","Fortune favors the bold","God helps those who help themselves","Good things come to those who wait","Honesty is the best policy","Hope for the best, prepare for the worst","If it ain’t broke, don’t fix it","If you can’t beat ’em, join ’em","If you play with fire, you’ll get burned","If you want something done right, you have to do it yourself","Keep your friends close, and your enemies closer","Knowledge is power","Laughter is the best medicine.","Like father, like son","No man is an island","People who live in glass houses should not throw stones","Practice makes perfect","The early bird gets the worm","The enemy of my enemy is my friend","The grass is always greener on the other side","The pen is mightier than the sword","There is no place like home","There is no such thing as a free lunch.","There is no time like the present","The squeaky wheel gets the grease","Time is money","Two heads are better than one","Two wrongs don’t make a right","When in Rome, do as the Romans do","When the going gets tough, the tough get going","Where there’s smoke, there’s fire","You can lead a horse to water, but you can’t make him drink it","You can’t always get what you want","A broken clock is right twice a day.","A friend in need is a friend indeed.","A little bit of knowledge is a dangerous thing.","A journey of a thousand miles begins with a single step.","All is fair in love and war.","All work and no play makes Jack a dull boy.","Better safe than sorry.","Better the devil you know than the one you don't.","Don't judge a man until you have walked a mile in his shoes.","Don't put the cart before the horse.","Don't talk the talk if you can't walk the walk.","Don't throw out the baby with the bath water.","Early to bed and early to rise makes a man healthy, wealthy and wise.","Every cloud has a silver lining.","Give a man a fish, he eats for a day. Teach a man how to fish, he eats for a lifetime.","Great minds think alike.","Haste makes waste.","Hindsight is 20/20","If at first you don't succeed, try, try again.","If wishes were horses, beggars would ride.","If you snooze, you lose.","If you don't have anything nice to say, don't say anything at all.","If you're not part of the solution, you're part of the problem.","It's no use crying over spilled milk.","It's not over 'till the fat lady sings.","Jack of all trades, master of none.","Knowledge is power.","Lie down with dogs, wake up with fleas.","Look before you leap.","Measure twice, cut once.","Misery loves company.","Never put off till (until) tomorrow what you can do today.","Power corrupts, and absolute power corrupts absolutely.","Rome wasn't built in a day.","Slow and steady wins the race.","Still waters run deep.","Strike while the iron is hot.","The apple doesn't fall far from the tree.","The road to hell is paved with good intentions.","The best way to a man's heart is through his stomach.","There's no such thing as bad publicity.","Time is money.","Two is company, three is a crowd.","What goes around comes around.","What goes up must come down.","What's good for the goose is good for the gander.","You can catch more flies with honey than with vinegar.","You can't have your cake and eat it too.","You can't teach an old dog new tricks.","You reap what you sow."]